# (3) Import Analysis Libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# (3) IMPORTING AND CALLING  customers.csv DATASET

In [3]:
df_customers = pd.read_csv(r'/Users/paolafattorini/Documents/4 PYTHON/10-2021 Instacart Basket Analysis  /Data/Original Data/customers.csv', index_col = False)

# head

In [5]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# (4) WRANGLE DATA so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [6]:
df_customers.rename(columns = {'STATE':'State'}, inplace = True)

In [7]:
df_customers.head(5)

,user_id,First Name,Surnam,Gender,State,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# (4) Rename

In [12]:
df_customers.rename(columns = {'Last name':'Last Name'}, inplace = True)

In [13]:
df_customers.head(5)

,user_id,First Name,Last Name,Gender,State,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [14]:
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

# (5) Mixed values and Missing Values

In [15]:
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

First Name

In [17]:
df_customers['First Name'] = df_customers['First Name'].astype('str')

In [18]:
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

In [19]:
df_customers.isnull().sum()

user_id         0
First Name      0
Last Name       0
Gender          0
State           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

# (5) Finding Duplicates

In [20]:
df_customers_dup = df_customers[df_customers.duplicated()]

In [21]:
df_customers_dup

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, date_joined, n_dependants, fam_status, income]
Index: []

# (6) Combine your customer data with the rest of your prepared Instacart data

# First analyze Key columns type

In [22]:
df_customers.dtypes

user_id          int64
First Name      object
Last Name       object
Gender          object
State           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# Import df_ords_prods_merge

In [ ]:
Import products clean

In [23]:
df_ords_prods_merge = pd.read_pickle(r'/Users/paolafattorini/Documents/4 PYTHON/10-2021 Instacart Basket Analysis  /Data/Prepared Data/Excercise 4.8/4.8TASK.pkl')

# (6) Merge/Combine

In [25]:
df_ords_prods_customers_merged = df_customers.merge(df_ords_prods_merge, on = 'user_id')

In [26]:
df_ords_prods_customers_merged.head(5)

,user_id,First Name,Last Name,Gender,State,Age,date_joined,n_dependants,fam_status,income,...,aisle_id,department_id,prices,price_range_loc,Busiest day,Busiest days,max_order,loyalty_flag,Spending_flag,Order_frequency_flag
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,77,7,9.0,Mid-range product,Regularly busy,Regularly busy,8,New customer,Lower_spender,Non-frequent customer
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,77,7,9.0,Mid-range product,Regularly busy,Regularly busy,8,New customer,Lower_spender,Regular customer
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,77,7,9.0,Mid-range product,Regularly busy,Regularly busy,8,New customer,Lower_spender,Frequent customer
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,120,16,12.6,Mid-range product,Regularly busy,Regularly busy,8,New customer,High spender,Regular customer
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,120,16,12.6,Mid-range product,Regularly busy,Slowest days,8,New customer,High spender,Non-frequent customer

# (8) PATH

In [28]:
path=r'/Users/paolafattorini/Documents/4 PYTHON/10-2021 Instacart Basket Analysis  /Data/Prepared Data/Excersise 4.9'

# (8) Export

In [29]:
df_ords_prods_customers_merged.to_pickle(os.path.join(path, 'Exercise 4.9'))